--liquibase formatted sql

--changeset rntgroup:1
INSERT INTO position (id, name)
VALUES (1, 'Финансовый директор (CFO)'),
       (2, 'Главный бухгалтер'),
       (3, 'Финансовый аналитик'),
       (4, 'Бухгалтер'),
       (5, 'Менеджер по закупкам'),
       (6, 'Специалист по управлению персоналом'),
       (7, 'Юрист'),
       (8, 'Руководитель проекта (Project Manager)'),
       (9, 'Менеджер проекта'),
       (10, 'Специалист по управлению проектами'),
       (11, 'Уборщик');

INSERT INTO employee (id, last_name, first_name, patronymic, sex, birth_date, phone_number, employment_date,
                      dismissal_date, position_id, salary, director, department_id)
VALUES (1, 'Иванов', 'Иван', 'Иванович', 'MALE', '1985-03-15', '+7 (495) 123-45-30', '2023-04-01', NULL, 1, 150000.00,
        TRUE, 1),
       (2, 'Петрова', 'Анна', 'Сергеевна', 'FEMALE', '1990-08-22', '+7 (495) 123-37-67', '2023-04-05', NULL, 2,
        100000.00, FALSE, 1),
       (3, 'Сидоров', 'Сергей', 'Петрович', 'MALE', '1988-11-07', '+7 (495) 123-12-67', '2023-04-10', NULL, 3, 80000.00,
        FALSE, 1),
       (4, 'Козлова', 'Ольга', 'Владимировна', 'FEMALE', '1992-05-12', '+7 (495) 123-11-67', '2023-04-15', '2023-09-15',
        4, 60000.00, FALSE, 1),
       (5, 'Смирнов', 'Дмитрий', 'Алексеевич', 'MALE', '1987-02-28', '+7 (495) 122-45-67', '2023-05-01', NULL, 5,
        70000.00, FALSE, 1),
       (6, 'Кузнецова', 'Екатерина', 'Николаевна', 'FEMALE', '1991-09-18', '+7 (950) 123-45-67', '2023-05-05', NULL, 6,
        50000.00, FALSE, 1),
       (7, 'Соколов', 'Алексей', 'Васильевич', 'MALE', '1986-07-04', '+7 (495) 123-23-67', '2023-05-10', NULL, 7,
        65000.00, FALSE, 1),
       (8, 'Попов', 'Андрей', 'Сергеевич', 'MALE', '1989-01-16', '+7 (495) 345-45-67', '2023-06-01', NULL, 8, 120000.00,
        TRUE, 2),
       (9, 'Васильева', 'Мария', 'Ивановна', 'FEMALE', '1993-06-29', '+7 (495) 123-45-34', '2023-06-05', NULL, 9,
        90000.00, FALSE, 2),
       (10, 'Федорова', 'Светлана', 'Петровна', 'FEMALE', '1994-12-11', '+7 (495) 123-45-57', '2023-06-10', NULL, 10,
        75000.00, FALSE, 2),
       (11, 'Борисов', 'Александр', 'Николаевич', 'MALE', '1984-09-03', '+7 (495) 133-45-67', '2023-07-01', NULL, 8,
        110000.00, TRUE, 3),
       (12, 'Егорова', 'Елена', 'Владимировна', 'FEMALE', '1995-03-27', '+7 (495) 123-45-67', '2023-07-05', NULL, 9,
        85000.00, FALSE, 3),
       (13, 'Зайцев', 'Николай', 'Иванович', 'MALE', '1983-10-14', '+7 (495) 123-47-67', '2023-07-10', NULL, 10,
        70000.00, FALSE, 3),
       (14, 'Кузьмина', 'Ирина', 'Сергеевна', 'FEMALE', '1996-08-09', '+7 (495) 823-45-67', '2023-08-01', NULL, 8,
        100000.00, TRUE, 4),
       (15, 'Морозов', 'Максим', 'Петрович', 'MALE', '1982-11-26', '+7 (495) 123-45-67', '2023-08-05', NULL, 9,
        80000.00, FALSE, 4),
       (16, 'Романова', 'Наталья', 'Алексеевна', 'FEMALE', '1997-04-05', '+7 (495) 123-65-67', '2023-08-10', NULL, 10,
        65000.00, FALSE, 4),
       (17, 'Абрамов', 'Евгений', 'Васильевич', 'MALE', '1981-05-23', '+7 (495) 223-45-67', '2023-09-01', NULL, 5,
        130000.00, FALSE, 5),
       (18, 'Белова', 'Татьяна', 'Владимировна', 'FEMALE', '1998-10-17', '+7 (495) 124-45-67', '2023-09-05', NULL, 6,
        95000.00, FALSE, 5),
       (19, 'Волков', 'Андрей', 'Николаевич', 'MALE', '1980-06-12', '+7 (495) 123-45-64', '2023-09-10', NULL, 4,
        75000.00, FALSE, 5);

ALTER SEQUENCE position_id_seq RESTART WITH 12;

ALTER SEQUENCE employee_id_seq RESTART WITH 20;